Revit 2027 API
Rectangle Constructor
Overload List
Name | Description
Rectangle() |  Create an empty Rectangle instance with values (0,0,0,0).
Rectangle(Rectangle) |  Constructs a new copy of the input ScreenRectangle object.
Rectangle(Int32, Int32, Int32, Int32) |  Creates an Rectangle instance with the specified four integers that represent the left, top, right and bottom of a rectangle.
Top
See Also
Reference
Rectangle Class
Autodesk.Revit.DB Namespace